ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/abstraction/include/cyabs_rtos.h
/** Get the event bits.
 *
 * Returns the current bits for the event.
 *
 * @param[in]  event Pointer to the event handle
 * @param[out] bits  pointer to receive the value of the event flags
 *
 * @return The status of the get request. [CY_RSLT_SUCCESS, CY_RTOS_NO_MEMORY, CY_RTOS_GENERAL_ERROR]
 */
extern cy_rslt_t cy_rtos_getbits_event(cy_event_t *event, uint32_t *bits) ;

/** Wait for the event and return bits.
 *
 * Waits for the event to be set and then returns the bits assocaited
 * with the event, or waits for the given timeout period.  
 * @note This function returns if any bit in the set is set. 
 *
 * @param[in] event     Pointer to the event handle
 * @param[in,out] bits  pointer to receive the value of the event flags
 * @param[in] clear     if true, clear any bits set that cause the wait to return
 *                      if false, do not clear bits
 * @param[in] all       if true, all bits in the initial bits value must be set to return
 *                      if false, any one bit in the initial bits value must be set to return
 * @param[in] timeout   The amount of time to wait in milliseconds
 *
 * @return The status of the wait for event request. [CY_RSLT_SUCCESS, CY_RTOS_NO_MEMORY, CY_RTOS_GENERAL_ERROR]
 */
extern cy_rslt_t cy_rtos_waitbits_event(cy_event_t *event, uint32_t *bits, bool clear, bool all, cy_time_t timeout) ;

/** Deinitialize a event.
 *
 * This function frees the resources associated with an event.
 *
 * @param[in] event Pointer to the event handle
 *
 * @return The status of the deletion request. [CY_RSLT_SUCCESS, CY_RTOS_GENERAL_ERROR]
 */
extern cy_rslt_t cy_rtos_deinit_event(cy_event_t *event) ;

/*********************************************** Queues **********************************************/

/** Create a queue.
 *
 * This is a queue of data where entries are placed on the back of the queue 
 * and removed from the front of the queue.
 *
 * @param[out] queue    Pointer to the queue handle
 * @param[in]  length   The maximum length of the queue in items
 * @param[in]  itemsize The size of each item in the queue.
 *
 * @return The status of the creation request. [CY_RSLT_SUCCESS, CY_RTOS_NO_MEMORY, CY_RTOS_GENERAL_ERROR]
 */
extern cy_rslt_t cy_rtos_init_queue(cy_queue_t *queue, size_t length, size_t itemsize) ;

/** Put an item in a queue.
 *
 * This function puts an item in the queue. The item is copied
 * into the queue using a memory copy and the data pointed to by item_ptr
 * is no longer referenced once the call returns.
 * 
 * @note If in_isr is true, timeout_ms must be zero.
 *
 * @param[in] queue      Pointer to the queue handle
 * @param[in] item_ptr   Pointer to the item to place in the queue
 * @param[in] timeout_ms The time to wait to place the item in the queue
 * @param[in] in_isr     If true this is being called from within and ISR
 *
 * @return The status of the creation request. [CY_RSLT_SUCCESS, CY_RTOS_NO_MEMORY, CY_RTOS_GENERAL_ERROR, CY_RTOS_QUEUE_FULL]
 */
extern cy_rslt_t cy_rtos_put_queue(cy_queue_t *queue, const void *item_ptr, cy_time_t timeout_ms, bool in_isr) ;

/** Gets an item in a queue.
 *
 * This function gets an item fropm the queue. The item is copied
 * out of the queue into the memory provide by item_ptr. This space must be 
 * large enough to hold a queue entry as defined when the queue was initialized.
 * 
 * @note If in_isr is true, timeout_ms must be zero.
 *
 * @param[in] queue     Pointer to the queue handle
 * @param[in] item_ptr  Pointer to the memory for the item from the queue
 * @param[in] timeout_ms The time to wait to place the item in the queue
 * @param[in] in_isr    If true this is being called from within and ISR
 *
 * @return The status of the creation request. [CY_RSLT_SUCCESS, CY_RTOS_NO_MEMORY, CY_RTOS_GENERAL_ERROR, CY_RTOS_QUEUE_EMPTY]
 */
extern cy_rslt_t cy_rtos_get_queue(cy_queue_t *queue, void *item_ptr, cy_time_t timeout_ms, bool in_isr) ;

/** Return the number of items in the queue.
 *
 * This function returns the number of items currently in the queue.
 * 
 * @param[in]  queue       Pointer to the queue handle
 * @param[out] num_waiting Pointer to the return count
 *
 * @return The status of the creation request. [CY_RSLT_SUCCESS, CY_RTOS_GENERAL_ERROR]
 */
extern cy_rslt_t cy_rtos_count_queue(cy_queue_t *queue, size_t *num_waiting) ;

/** Return the amount of empty space in the queue.
 *
 * This function returns the amount of empty space in the 
 * queue. For instance, if the queue was created with 10 entries max and there
 * are currently 2 entries in the queue, this will return 8.
 * 
 * @param[in]  queue      Pointer to the queue handle
 * @param[out] num_spaces Pointer to the return count.
 *
 * @return The status of the creation request. [CY_RSLT_SUCCESS, CY_RTOS_GENERAL_ERROR]
 */
extern cy_rslt_t cy_rtos_space_queue(cy_queue_t *queue, size_t *num_spaces) ;

/** Reset the queue.
 *
 * This function sets the queue to empty.
 * 
 * @param[in] queue pointer to the queue handle
 *
 * @return The status of the creation request. [CY_RSLT_SUCCESS, CY_RTOS_GENERAL_ERROR]
 */
extern cy_rslt_t cy_rtos_reset_queue(cy_queue_t *queue) ;

/** Deinitialize the queue handle.
 *
 * This function deinitializes the queue and returns all
 * resources used by the queue.
 * 
 * @param[in] queue Pointer to the queue handle
 *
 * @return The status of the creation request. [CY_RSLT_SUCCESS, CY_RTOS_GENERAL_ERROR]
 */
extern cy_rslt_t cy_rtos_deinit_queue(cy_queue_t *queue) ;

/*********************************************** Timers **********************************************/

/** Create a new timer.
 *
 * This function intializes a timer object. @note The timer is
 * not active until start is called.
 * 
 * @param[out] timer Pointer to the timer handle to initalize
 * @param[in]  type  Type of timer (periodic or once)
 * @param[in]  fun   The functiuon
 * @param[in]  arg   Argument to pass along to the callback function
 *
 * @return The status of the creation request. [CY_RSLT_SUCCESS, CY_RTOS_GENERAL_ERROR]
 */
extern cy_rslt_t cy_rtos_init_timer(cy_timer_t *timer, cy_timer_trigger_type_t type, 
        cy_timer_callback_t fun, cy_timer_callback_arg_t arg) ;

/** Start a timer.
 * 
 * @note The callback may be (likely will be) called from a different thread.
 * 
 * @param[in] timer  Pointer to the timer handle
 * @param[in] num_ms The number of miliseconds to wait before the timer fires
 *
 * @return The status of the creation request. [CY_RSLT_SUCCESS, CY_RTOS_GENERAL_ERROR]
 */
extern cy_rslt_t cy_rtos_start_timer(cy_timer_t *timer, cy_time_t num_ms) ;

/** Stop a timer.
 *
 * @param[in] timer Pointer to the timer handle
 *
 * @return The status of the creation request. [CY_RSLT_SUCCESS, CY_RTOS_GENERAL_ERROR]
 */
extern cy_rslt_t cy_rtos_stop_timer(cy_timer_t *timer) ;

/** Returns state of a timer.
 *
 * @param[in]  timer Pointer to the timer handle
 * @param[out] state Return value for state, true if running, false otherwise
 *
 * @return The status of the creation request. [CY_RSLT_SUCCESS, CY_RTOS_GENERAL_ERROR]
 */
extern cy_rslt_t cy_rtos_is_running_timer(cy_timer_t *timer, bool *state) ;

/** Deinit the timer.
 *
 * This function de initializes the timer and frees all consumed
 * resources.
 *
 * @param[in] timer Pointer to the timer handle
 *
 * @return The status of the creation request. [CY_RSLT_SUCCESS, CY_RTOS_GENERAL_ERROR]
 */
extern cy_rslt_t cy_rtos_deinit_timer(cy_timer_t *timer) ;

/*********************************************** Time **********************************************/

/** Gets time in milliseconds since RTOS start.
 *
 * @note Since this is only 32 bits, it will roll over every 49 days, 17 hours, 2 mins, 47.296 seconds
 *
 * @param[out] tval Pointer to the struct to populate with the RTOS time
 *
 * @returns Time in milliseconds since the RTOS started.
 */
extern cy_rslt_t cy_rtos_get_time(cy_time_t *tval);

/** Delay for a number of milliseconds.
 *
 * Processing of this function depends on the minimum sleep
 * time resolution of the RTOS. The current thread should sleep for
 * the longest period possible which is less than the delay required,
 * then makes up the difference with a tight loop.
 *
 * @param[in] num_ms The number of miliseconds to delay for
 *
 * @return The status of the creation request. [CY_RSLT_SUCCESS, CY_RTOS_GENERAL_ERROR]
 */
extern cy_rslt_t cy_rtos_delay_milliseconds(cy_time_t num_ms);

/** \} group_abstraction_rtos_functions */

/** @} */

#ifdef __cplusplus
} /* extern "C" */
#endif
#endif /* ifndef INCLUDED_CY_RTOS_INTERFACE_H_ */

